app/Controllers/AuthController.php

    public function loginAuth()
    {
        $userModel = new UserModel();
        $data = [
            'username' => $this->request->getPost('username'),
            'password' => $this->request->getPost('password'),
        ];

        $user = $userModel->where('username', $data['username'])->first();
---
SELECT *
FROM `users`
WHERE `username` = 'alman123'
 LIMIT 1