app/Controllers/KaryawanController.php

SELECT *
FROM `users`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT *
FROM `users`
WHERE `role_name` = 2
---
    public function list()
    {
        $per_page = 5;
        $karyawans = $this->userModel->paginate($per_page);
        $karyawans = $this->userModel->where('role_name', 2)->findAll();