app/Controllers/ProductController.php

SELECT *
FROM `products`
---
    public function create()
    {

        $product = $this->productModel->findAll();

SELECT *
FROM `products`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `products`
---
    public function list()
    {
        $per_page = 5;
        $products = $this->productModel->paginate($per_page);