app/Controllers/SupplierController.php

SELECT *
FROM `suppliers`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `suppliers`
---
    public function list()
    {
        $per_page = 5;
        $suppliers = $this->supplierModel->paginate($per_page);