app/Models/UserModel.php

    public function getRoles()
    {
        return $this->db->table('roles')->get()->getResultArray();
---
SELECT *
FROM `roles`